app/controllers/calculation_controller.rb

SELECT "shows".* FROM "shows"  WHERE "shows"."id" IN (2, 21, 25, 35, 78, 82, 84, 107, 261, 404, 432, 443, 445)
---
  def results
    shows = Show.find(params[:shows])