app/controllers/networks_controller.rb

SELECT "networks".* FROM "networks"
---
  def index
    @networks = Network.all