app/controllers/shows_controller.rb

  def index
    if params[:networks].present?
      @shows = Show.where(network: params[:networks])
    else
      @shows = Show.all
---
SELECT "shows".* FROM "shows"  WHERE "shows"."network_id" IN (2, 6, 7, 11)
SELECT "shows".* FROM "shows"